docs/artillery-medium.txt
Test run id: tk47q_4z49xhgm76pqy5mjdtxc4c3r5kjb8_jpbx
Phase started: Carga media (index: 0, duration: 60s) 03:11:29(-0500)

--------------------------------------
Metrics for period to: 03:11:40(-0500) (width: 9.458s)
--------------------------------------

http.codes.200: ................................................................ 100
http.downloaded_bytes: ......................................................... 10200
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.4
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.4
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 4
http.responses: ................................................................ 100
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Prueba media HAProxy: ................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3
  max: ......................................................................... 20.2
  mean: ........................................................................ 5.3
  median: ...................................................................... 4.3
  p95: ......................................................................... 11.4
  p99: ......................................................................... 19.1


--------------------------------------
Metrics for period to: 03:11:50(-0500) (width: 9.458s)
--------------------------------------

http.codes.200: ................................................................ 100
http.downloaded_bytes: ......................................................... 10200
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 5
  mean: ........................................................................ 2.3
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 5
  mean: ........................................................................ 2.3
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.responses: ................................................................ 100
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Prueba media HAProxy: ................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.6
  max: ......................................................................... 8.3
  mean: ........................................................................ 4.2
  median: ...................................................................... 3.9
  p95: ......................................................................... 5.9
  p99: ......................................................................... 6.4


--------------------------------------
Metrics for period to: 03:12:00(-0500) (width: 9.458s)
--------------------------------------

http.codes.200: ................................................................ 100
http.downloaded_bytes: ......................................................... 10200
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.responses: ................................................................ 100
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Prueba media HAProxy: ................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 5.8
  mean: ........................................................................ 3.7
  median: ...................................................................... 3.6
  p95: ......................................................................... 5
  p99: ......................................................................... 5.6


--------------------------------------
Metrics for period to: 03:12:10(-0500) (width: 9.457s)
--------------------------------------

http.codes.200: ................................................................ 100
http.downloaded_bytes: ......................................................... 10200
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 3
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 3
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.responses: ................................................................ 100
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Prueba media HAProxy: ................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 5.9
  mean: ........................................................................ 3.6
  median: ...................................................................... 3.4
  p95: ......................................................................... 4.8
  p99: ......................................................................... 5.8


--------------------------------------
Metrics for period to: 03:12:20(-0500) (width: 9.457s)
--------------------------------------

http.codes.200: ................................................................ 100
http.downloaded_bytes: ......................................................... 10200
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 5
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 5
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 100
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Prueba media HAProxy: ................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.2
  max: ......................................................................... 5.5
  mean: ........................................................................ 3.4
  median: ...................................................................... 3.2
  p95: ......................................................................... 4.8
  p99: ......................................................................... 5.5


Phase completed: Carga media (index: 0, duration: 60s) 03:12:29(-0500)

--------------------------------------
Metrics for period to: 03:12:30(-0500) (width: 9.458s)
--------------------------------------

http.codes.200: ................................................................ 100
http.downloaded_bytes: ......................................................... 10200
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 4
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 100
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.Prueba media HAProxy: ................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 6.4
  mean: ........................................................................ 3.6
  median: ...................................................................... 3.4
  p95: ......................................................................... 5.1
  p99: ......................................................................... 5.9


All VUs finished. Total time: 1 minute, 2 seconds

--------------------------------
Summary report @ 03:12:32(-0500)
--------------------------------

http.codes.200: ................................................................ 600
http.downloaded_bytes: ......................................................... 61200
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 600
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 5
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 5
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 600
vusers.completed: .............................................................. 600
vusers.created: ................................................................ 600
vusers.created_by_name.Prueba media HAProxy: ................................... 600
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.2
  max: ......................................................................... 20.2
  mean: ........................................................................ 4
  median: ...................................................................... 3.6
  p95: ......................................................................... 5.9
  p99: ......................................................................... 11.1